name: "ens_det_trt"
platform: "ensemble"
max_batch_size: 8

input [
  { name: "images" data_type: TYPE_FP32 dims: [ 3, 640, 640 ] }
]
output [
  { name: "output0" data_type: TYPE_FP32 dims: [ -1, -1 ] }
]

ensemble_scheduling {
  step [
    {
      model_name: "det_trt_plan"
      model_version: -1
      input_map { key: "images" value: "images" }
      output_map { key: "output0" value: "output0" }
    }
  ]
}

